EDTДоговоры_ПРОФ_демо/src/Catalogs/ДоговорныеДокументы/ДоговорныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорныеДокументы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <comment>Дата начала действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <comment>Дата окончания действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорныеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПрописью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСПрописью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСогласования</name>
      <type>
        <types>EnumRef.РезультатыСогласования</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСогласования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрохождения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDTДоговоры_ПРОФ_демо/src/Enums/СпособыНумерации/СпособыНумерации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНумерации</name>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

EDTДоговоры_ПРОФ_демо/src/Enums/ТипыДоговорныхДокументов/ТипыДоговорныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговорныхДокументов</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДопСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Акт</name>
  </enumValues>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>Счет</name>
  </enumValues>
</mdclass:Enum>

EDTДоговоры_ПРОФ_демо/src/Catalogs/ДоговорныеДокументы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		ДатаСоздания = ТекущаяДатаСеанса();
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	Закрыт = Ложь;
	
	Для Каждого Строка Из Согласующие Цикл
		Строка.РезультатСогласования = Неопределено;
		Строка.ДатаСогласования = '00010101';
	КонецЦикла;
	
	Для Каждого Строка Из Этапы Цикл
		Строка.Пройден = Ложь;
		Строка.ДатаПрохождения = '00010101';
	КонецЦикла;
	
	ДатаДокумента = ТекущаяДатаСеанса();
	НомерДокумента = "";
	
	СпособНумерации = ВидДокумента.СпособНумерации;
	Если СпособНумерации = Перечисления.СпособыНумерации.Автоматически Тогда 
		Нумерация.СформироватьЧисловойНомерДокумента(ЭтотОбъект, ЧисловойНомер);
			
		ОписанияОшибок = Новый СписокЗначений;
		Нумерация.СформироватьСтроковыйНомерДокумента(ЭтотОбъект, НомерДокумента, ОписанияОшибок);
		
		Для Каждого ОписаниеОшибки Из ОписанияОшибок Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ОписаниеОшибки.Представление,,
				ОписаниеОшибки.Значение,
				"Объект");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда 
		Если КоличествоСеансовИнформационнойБазы() > 1 Тогда 
			ВызватьИсключение НСтр("ru = 'Базовая версия не поддерживает одновременную работу нескольких пользователей.'");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Согласующие, ПометкаУдаления");
		ПредыдущиеЗначенияРеквизитов.Согласующие = ПредыдущиеЗначенияРеквизитов.Согласующие.Выгрузить();
	Иначе
		ПредыдущиеЗначенияРеквизитов = Новый Структура;
		ПредыдущиеЗначенияРеквизитов.Вставить("Согласующие", Новый ТаблицаЗначений);
		ПредыдущиеЗначенияРеквизитов.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
	Наименование = Строка(ВидДокумента) + " " + НСтр("ru = 'с'") + " " + Строка(Контрагент);
	Если ЗначениеЗаполнено(НомерДокумента) Тогда 
		Наименование = Наименование + " " +
			СтрШаблон(НСтр("ru = '№ %1 от %2'"), 
				НомерДокумента, Формат(ДатаДокумента, "ДЛФ=D"));
	КонецЕсли;
	
	НомерИДатаДокумента = "";
	Если ЗначениеЗаполнено(НомерДокумента) И ЗначениеЗаполнено(ДатаДокумента) Тогда 
		НомерИДатаДокумента = СтрШаблон(НСтр("ru = '%1 от %2'"), 
			НомерДокумента, Формат(ДатаДокумента, "ДЛФ=D"));
	КонецЕсли;	
	
	СрокДействия = "";
	Если ЗначениеЗаполнено(ДатаНачалаДействия) И ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда 
		СрокДействия = Формат(ДатаНачалаДействия, "ДЛФ=D") + " - " + Формат(ДатаОкончанияДействия, "ДЛФ=D");
	ИначеЕсли ЗначениеЗаполнено(ДатаНачалаДействия) Тогда 
		СрокДействия = Формат(ДатаНачалаДействия, "ДЛФ=D") + ", бессрочно";
	КонецЕсли;
	
	ДатаСортировки = ДатаСоздания;
	Если ЗначениеЗаполнено(ДатаДокумента) Тогда 
		ДатаСортировки = ДатаДокумента;
	КонецЕсли;
	
	Если ПометкаУдаления И ПометкаУдаления <> ПредыдущиеЗначенияРеквизитов.ПометкаУдаления Тогда
		ДополнительныеСвойства.Вставить("УстановленаПометкаУдаления");
	КонецЕсли;
	
	ОбработатьИзменениеСогласующих(ПредыдущиеЗначенияРеквизитов);
	
	ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "Тип");
	
	Если ЗначениеЗаполнено(Родитель) И ТипДокумента <> Перечисления.ТипыДоговорныхДокументов.Договор Тогда 
		РодительДоКорня = Родитель;
		Пока ЗначениеЗаполнено(РодительДоКорня) Цикл 
			Договор = РодительДоКорня;
			РодительДоКорня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РодительДоКорня, "Родитель");
		КонецЦикла;
	КонецЕсли;
	
	Если СуммаДокумента > 0 Тогда 
		ФормСтрока = "Л = ru_RU";
		ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
		СуммаПрописью = ЧислоПрописью(СуммаДокумента, ФормСтрока, ПарПредмета);
	КонецЕсли;
	
	Если СуммаНДСДокумента > 0 Тогда 
		ФормСтрока = "Л = ru_RU";
		ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
		СуммаНДСПрописью = ЧислоПрописью(СуммаНДСДокумента, ФормСтрока, ПарПредмета);
	КонецЕсли;
	
	// Пометка на удаление приложенных файлов.
	Если ПометкаУдаления <> ПредыдущиеЗначенияРеквизитов.ПометкаУдаления Тогда 
		
		РаботаСФайламиВызовСервера.ПометитьНаУдалениеПриложенныеФайлы(Ссылка, ПометкаУдаления);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НовыеСогласующие") Тогда
		Для Каждого НовыйСогласующий Из ДополнительныеСвойства.НовыеСогласующие Цикл
			РаботаССообщениями.ДобавитьСообщениеОНазначенииСогласующим(НовыйСогласующий, Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗаконченоСогласование") Тогда
		РаботаССообщениями.ДобавитьСообщениеОбОкончанииСогласования(Ответственный, Ссылка);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("УстановленаПометкаУдаления") Тогда
		Справочники.Сообщения.ПометитьНаУдалениеПоПредмету(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЧисловойНомер > 0 Тогда
		СтруктураПараметров = НумерацияКлиентСервер.ПолучитьПараметрыНумерации(ЭтотОбъект);
		Нумерация.ОсвободитьНомер(СтруктураПараметров);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(НомерДокумента) И ЗначениеЗаполнено(ДатаДокумента) Тогда 
		Если Не ДоговорныеДокументы.НомерДокументаУникален(ЭтотОбъект) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Номер документа не уникален!'"),
				ЭтотОбъект,
				"НомерДокумента",, 
				Отказ);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает изменение согласующих.
//
Процедура ОбработатьИзменениеСогласующих(ПредыдущиеЗначенияРеквизитов)
	
	Если Согласующие.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Новые согласующие
	Если ЭтоНовый() Тогда
		СтарыеСогласующие = Новый ТаблицаЗначений;
		СтарыеСогласующие.Колонки.Добавить("Исполнитель");
		СтарыеСогласующие.Колонки.Добавить("РезультатСогласования");
		СтарыеСогласующие.Колонки.Добавить("ДатаСогласования");
	Иначе
		РезультатЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Согласующие");
		СтарыеСогласующие = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	НовыеСогласующие = Новый Массив;
	ЗаконченоСогласование = Истина;
	Для Каждого СтрокаСогласования Из Согласующие Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаСогласования.РезультатСогласования) Тогда
			ЗаконченоСогласование = Ложь;
		КонецЕсли;
		
		НайденнаяСтрока = СтарыеСогласующие.Найти(СтрокаСогласования.Исполнитель, "Исполнитель");
		Если НайденнаяСтрока = Неопределено Тогда
			НовыеСогласующие.Добавить(СтрокаСогласования.Исполнитель);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НовыеСогласующие.Количество() <> 0 Тогда
		ДополнительныеСвойства.Вставить("НовыеСогласующие", НовыеСогласующие);
	КонецЕсли;
	
	Если Не ЗаконченоСогласование Тогда
		Возврат;
	КонецЕсли;
	
	// Закончено согласование
	РанееЗаконченоСогласование = Истина;
	Для Каждого СтрокаСогласования Из СтарыеСогласующие Цикл
		Если Не ЗначениеЗаполнено(СтрокаСогласования.РезультатСогласования) Тогда
			РанееЗаконченоСогласование = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не РанееЗаконченоСогласование Тогда
		ДополнительныеСвойства.Вставить("ЗаконченоСогласование");
	КонецЕсли;
	
КонецПроцедуры

Функция КоличествоСеансовИнформационнойБазы(УчитыватьКонсоль = Истина, УчитыватьФоновыеЗадания = Истина) Экспорт
	
	Результат = 0;
	
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();
	Для Каждого СеансИБ Из СеансыИБ Цикл
		Если СеансИБ.ИмяПриложения = "SrvrConsole"
		 Или СеансИБ.ИмяПриложения = "BackgroundJob" 
		 Или СеансИБ.ИмяПриложения = "Designer" Тогда
			Продолжить;
		КонецЕсли;
		Результат = Результат + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
